# Project 3 part 3: SQL Database
- Coire Gavin-Hanner
- 10/3/22

# Task: Create a MySQL Database from the data cleaned and collected in parts 1 and 2

## Specifications from client
- TMDB information should be in a single table even if it is not perfectly normalized.

## Database Requirements
- Tables
    - title_basics
    - title_ratings
    - title_genres
        - tconst
        - genre_id
    - genres
        - genre_id
        - genre_name
    - tmbd_data
        - imdb_id
        - revenue
        - budget
        - certification

# Imports and Definitions

In [89]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *
import json

# Source Data

In [24]:
basics_df = pd.read_csv('Data/basics.csv.gz')
akas_df = pd.read_csv('Data/akas.csv.gz')
ratings_df = pd.read_csv('Data/ratings.csv.gz')

In [25]:
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz', lineterminator='\n')

In [26]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82697 entries, 0 to 82696
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      82697 non-null  int64
 1   tconst          82697 non-null  object
 2   titleType       82697 non-null  object
 3   primaryTitle    82697 non-null  object
 4   originalTitle   82697 non-null  object
 5   isAdult         82697 non-null  int64
 6   startYear       82697 non-null  float64
 7   endYear         0 non-null      float64
 8   runtimeMinutes  82697 non-null  int64
 9   genres          82697 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.3+ MB

In [27]:
basics_df.head()

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34792,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61094,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,67640,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,86771,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,93907,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

# Normalization

## Genres

### Getting a list of Unique Genres

In [28]:
# Get a list of unique genres
basics_df['genres_split'] = basics_df['genres'].str.split(',')

In [29]:
exploded_genres = basics_df.explode('genres_split')

In [30]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [31]:
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

### create a title_genres table

In [32]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

### create genre mapper dictionary to replace string genres with integers

In [33]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

### Replace the string genres in title_genres with the new integer IDs

In [41]:
title_genres['genre_id'] = title_genres['genres_split'].replace(genre_map)

In [43]:
title_genres.drop(columns='genres_split', inplace=True)

In [34]:
basics_df.head()

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,34792,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,61094,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,[Drama]
2,67640,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,86771,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,93907,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]

### create new genres_df with id and string name

In [40]:
genres_df = pd.DataFrame({'genre_name': genre_map.keys(),
                          'genre_id': genre_map.values()})
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### remove genre information from basics_df

In [44]:
basics_df.drop(columns=['genres', 'genres_split'], inplace=True)

In [45]:
basics_df.head()

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes
0,34792,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118
1,61094,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70
2,67640,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122
3,86771,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100
4,93907,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126

## Remove Unecessary Columns

### basics_df

In [46]:
basics_df.head()

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes
0,34792,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118
1,61094,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70
2,67640,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122
3,86771,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100
4,93907,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126

In [50]:
basics_df.drop(columns=['Unnamed: 0', 'originalTitle', 'isAdult', 'titleType'], inplace=True)

In [51]:
basics_df.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0088751,The Naked Monster,2005.0,NaN,100
4,tt0096056,Crime and Punishment,2002.0,NaN,126

### tmdb data
- "You only need to keep the imdb_id, revenue, budget, and certification columns"

In [53]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60706 entries, 0 to 60705
Data columns (total 27 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             60706 non-null  int64
 1   imdb_id                60706 non-null  object
 2   adult                  60683 non-null  float64
 3   backdrop_path          37940 non-null  object
 4   belongs_to_collection  3908 non-null   object
 5   budget                 60683 non-null  float64
 6   genres                 60683 non-null  object
 7   homepage               14929 non-null  object
 8   id                     60683 non-null  float64
 9   original_language      60683 non-null  object
 10  original_title         60683 non-null  object
 11  overview               59348 non-null  object
 12  popularity             60683 non-null  float64
 13  poster_path            55252 non-null  object
 14  production_companies   60683 non-null  object
 15  production_countries   60683 non-null  object
 16  release_date           59623 non-null  object
 17  revenue                60683 non-null  float64
 18  runtime                60683 non-null  float64
 19  spoken_languages       60683 non-null  object
 20  status                 60683 non-null  object
 21  tagline                22966 non-null  object
 22  title                  60683 non-null  object
 23  video                  60683 non-null  float64
 24  vote_average           60683 non-null  float64
 25  vote_count             60683 non-null  float64
 26  certification          14968 non-null  object
dtypes: float64(9), int64(1), object(17)
memory usage: 12.5+ MB

In [54]:
tmdb_df = tmdb_df[['imdb_id', 'revenue', 'budget', 'certification']]

In [58]:
tmdb_df.rename(columns={'imdb_id':'tconst'}, inplace=True)

In [59]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60706 entries, 0 to 60705
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         60706 non-null  object
 1   revenue        60683 non-null  float64
 2   budget         60683 non-null  float64
 3   certification  14968 non-null  object
dtypes: float64(2), object(2)
memory usage: 1.9+ MB

### ratings_df

In [69]:
ratings_df.drop(columns='Unnamed: 0', inplace=True)

In [70]:
ratings_df.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     84809
1  tt0062336            6.4       161
2  tt0069049            6.7      7374
3  tt0088751            5.3       327
4  tt0096056            5.6       821

### Duplicates?

In [110]:
tmdb_df[tmdb_df.duplicated()]

      tconst  revenue  budget certification
1615       0      NaN     NaN           NaN
3043       0      NaN     NaN           NaN
7589       0      NaN     NaN           NaN
10169      0      NaN     NaN           NaN
13383      0      NaN     NaN           NaN

In [111]:
tmdb_df[tmdb_df.duplicated()]['tconst'].unique()

array(['0'], dtype=object)

In [122]:
# remove tmdb rows with tconst=0
tmdb_df = tmdb_df.loc[tmdb_df['tconst'] != '0',:]

# Saving MySQL tables with tconst as primary key

## if we had integer index...
```
df.set_index('int_index').to_sql('table_name',engine,index=True)```

## Using tconst (a string index)
    - provide SQL datatype schema of columns when we create the tables
    - make a dictionary with column names as key and sql data types as values
    - reminder strings need to be provided a length. Get max length of string in column with
         ```max_str_len = df['column'].fillna('').map(len).max()```

In [57]:
def max_len(df, col):
    return df[col].fillna('').map(len).max()

In [71]:
title_basics_schema = {'tconst': String(max_len(basics_df, 'tconst')+1),
                       'primaryTitle': Text(max_len(basics_df, 'primaryTitle')+1),
                       'startYear': Integer(),
                       'endYear': Integer(),
                       'runtimeMinutes': Integer()}

In [77]:
ratings_df.head(2)

      tconst  averageRating  numVotes
0  tt0035423            6.4     84809
1  tt0062336            6.4       161

In [78]:
title_ratings_schema = {'tconst': String(max_len(ratings_df, 'tconst')+1),
                       'averageRating': Float(),
                       'numVotes': Integer()}

In [76]:
title_genres.head(2)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9

In [79]:
title_genres_schema = {'tconst': String(max_len(title_genres, 'tconst')+1),
                      'genre_id': Integer()}

In [82]:
genres_df.head(2)

  genre_name  genre_id
0     Action         0
1      Adult         1

In [83]:
genres_df.set_index('genre_id', inplace=True)

In [66]:
tmdb_data_schema = {'tconst': String(max_len(tmdb_df, 'tconst')+1),
               'revenue': Float(),
               'budget': Float(),
               'certification': Text(max_len(tmdb_df, 'certification')+1)}

## Connect to MySQL

In [90]:
# Load MySQL credentials
with open('/Users/coire/.secret/MySQL.json') as f:   #use your path here!
    login = json.load(f)
PWD = login['PWD']

In [91]:
connection = f'mysql+pymysql://root:{PWD}@localhost/movies'

In [92]:
engine = create_engine(connection)

In [93]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

## Create Tables

### title_basics

In [94]:
basics_df.to_sql('title_basics',
                 engine,
                 dtype=title_basics_schema, 
                 if_exists='replace',
                 index=False)

82697

In [100]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [125]:
q = '''
SELECT *
FROM title_basics
LIMIT 5; '''

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
2,tt0069049,The Other Side of the Wind,2018,None,122
3,tt0088751,The Naked Monster,2005,None,100
4,tt0096056,Crime and Punishment,2002,None,126

### title_ratings

In [95]:
ratings_df.to_sql('title_ratings',
                 engine,
                 dtype=title_ratings_schema, 
                 if_exists='replace',
                 index=False)

67942

In [101]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [126]:
q = '''
SELECT *
FROM title_ratings
LIMIT 5; '''

pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     84809
1  tt0062336            6.4       161
2  tt0069049            6.7      7374
3  tt0088751            5.3       327
4  tt0096056            5.6       821

### title_genres

In [96]:
title_genres.to_sql('title_genres',
                 engine,
                 dtype=title_genres_schema, 
                 if_exists='replace',
                 index=False)

154586

In [127]:
q = '''
SELECT *
FROM title_genres
LIMIT 5; '''

pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### genres

In [98]:
genres_df.to_sql('genres', engine, if_exists='replace', index=True)

26

In [131]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [128]:
q = '''
SELECT *
FROM genres
LIMIT 5; '''

pd.read_sql(q, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

### tmdb_data

In [123]:
tmdb_df.to_sql('tmdb_data',
               engine,
               dtype=tmdb_data_schema,
               if_exists='replace',
               index=False)

60683

In [124]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`tconst`);')

In [129]:
q = '''
SELECT *
FROM tmdb_data
LIMIT 5; '''

pd.read_sql(q, engine)

      tconst     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0062336         0.0         0.0          None
2  tt0069049         0.0  12000000.0             R
3  tt0088751         0.0    350000.0          None
4  tt0096056         0.0         0.0          None

## Check tables in database

In [130]:
q = '''
SHOW TABLES; '''

pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data